01_env/bench/dbFine/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    leftWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       72160;
    }
    rightWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       72360;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          248;
        startFace       72560;
    }
    atmosphere
    {
        type            patch;
        nFaces          184;
        startFace       72808;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          72576;
        startFace       72992;
    }
)

// ************************************************************************* //
